In [1]:
import pandas as pd
import psycopg2
from psycopg2.extensions import ISOLATION_LEVEL_AUTOCOMMIT
#Create an in-memory SQLite database.
#https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_sql.html
# sqlalchemy será usado para o envio de DataFlames diretamente para o banco.
from sqlalchemy import create_engine
from sqlalchemy import types

Questionamento #1

Quantos itens foram vendidos no total?

In [2]:
sql = 'SELECT COUNT(units) FROM  vendas;'
engine = create_engine('postgresql://postgres:postgres@amarelo.cp6xfa6zogly.us-east-2.rds.amazonaws.com:5432/dbpy')
pd.read_sql(sql,engine)

     count
0  1260752

Questionamento #2

Quais foram as cidades fizeram mais vendas?

In [20]:
sql = 'SELECT city, units FROM geo, vendas  WHERE geo.zip = vendas.zip ORDER BY units DESC LIMIT 10 ;'
engine = create_engine('postgresql://postgres:postgres@amarelo.cp6xfa6zogly.us-east-2.rds.amazonaws.com:5432/dbpy')
pd.read_sql(sql,engine)

              city  units
0  West Sacramento     92
1            Miami     44
2            Miami     44
3        Creedmoor     40
4        Creedmoor     40
5           Normal     40
6        Nashville     36
7           Austin     33
8  West Sacramento     31
9       Rapid City     31

Questionamento #3

Qual o mês com a maior receita de vendas da Van Arsdel?

In [4]:
sql = 'SELECT vendas.revenue, vendas.date FROM vendas, produto WHERE produto.manufacturerid = 7 LIMIT 1;'
pd.read_sql(sql,engine)

   revenue        date
0  1700.37  2011-06-28

Questionamento #4

Qual a média de receita do setor por ano?

In [ ]:
sql = 'SELECT AVG(vendas.revenue) ,  produto.segment FROM vendas, produto GROUP BY  produto.segment ;'
pd.read_sql(sql,engine)

Questionamento #5

Qual o segmento mais lucrativo para a Van Arsdel?

In [4]:
sql = 'SELECT AVG(vendas.revenue) ,  produto.segment FROM vendas, produto WHERE produto.manufacturerid = 7 GROUP BY  produto.segment  LIMIT 1 ;'
pd.read_sql(sql,engine)

           avg  segment
0  5571.784354  Extreme

Questionamento #6

Dentro do segmento menos lucrativo, qual foi o produto que gerou mais receita?

In [27]:
engine = create_engine('postgresql://postgres:postgres@localhost:5432/dbpy')
sql = "SELECT vendas.productid ,  vendas.revenue FROM vendas, produto WHERE produto.segment = 'Select'  ORDER BY vendas.revenue ASC LIMIT 1 ;"
pd.read_sql(sql,engine)
#segment = select

   productid  revenue
0       1099   427.77

Questionamento #7

Qual o pior concorrente da Van Arsdel? Por quê?

In [ ]:
# Concorrente trabalha no mesmo segmento principal
sql = "SELECT fabricante.manufacturer, sum(vendas.revenue) FROM fabricante, vendas, produto WHERE produto.segment = 'Extreme' GROUP BY  fabricante.manufacturer LIMIT 1;"
#engine = create_engine('postgresql://postgres:postgres@amarelo.cp6xfa6zogly.us-east-2.rds.amazonaws.com:5432/dbpy')
engine = create_engine('postgresql://postgres:postgres@localhost:5432/dbpy')
pd.read_sql(sql,engine)

Questionamento #8

Do estado com maior número de cidade distintas, qual foi a cidade que mais fez receita?

In [3]:
sql = 'SELECT  count(DISTINCT city) AS count , state FROM geo GROUP BY state ORDER BY count DESC LIMIT 1 ;'
pd.read_sql(sql,engine)

   count state
0   1800    PA

In [25]:
engine = create_engine('postgresql://postgres:postgres@localhost:5432/dbpy')
sql = "SELECT  sum(revenue) AS sum , city FROM vendas, geo WHERE geo.state= 'PA' GROUP BY city  ORDER BY sum DESC LIMIT 1 ;"
pd.read_sql(sql,engine)

            sum          city
0  6.111237e+11  Philadelphia

# Espaço para pesquisar os DFs

In [ ]:
sql = 'SELECT * FROM  vendas;'
engine = create_engine('postgresql://postgres:postgres@amarelo.cp6xfa6zogly.us-east-2.rds.amazonaws.com:5432/dbpy')
pd.read_sql(sql,engine)

In [5]:
df_fabricante = pd.read_csv('fabricante.csv',',') #Importando o arquivo CSV
df_fabricante

    Unnamed: 0  manufacturerid manufacturer
0            0               6          Leo
1            1              12       Quibus
2            2               1        Abbas
3            3               2       Aliqui
4            4              14     Victoria
5            5               8       Natura
6            6               4       Currus
7            7               9        Palma
8            8              13       Salvus
9            9               5         Fama
10          10              11        Pomum
11          11              10        Pirum
12          12               3        Barba
13          13               7    VanArsdel

In [6]:
df_geo = pd.read_csv('geo.csv',',')
df_geo

         zip              city state region      district
0      15201    Pittsburgh, PA    PA   East  District #13
1      15202    Pittsburgh, PA    PA   East  District #13
2      15203    Pittsburgh, PA    PA   East  District #13
3      15204    Pittsburgh, PA    PA   East  District #13
4      15205    Pittsburgh, PA    PA   East  District #13
...      ...               ...   ...    ...           ...
39943  59933       Stryker, MT    MT   West  District #33
39944  59934         Trego, MT    MT   West  District #33
39945  59935          Troy, MT    MT   West  District #33
39946  59936  West Glacier, MT    MT   West  District #33
39947  59937     Whitefish, MT    MT   West  District #33

[39948 rows x 5 columns]

In [7]:
df_produto = pd.read_csv('produto.csv',',')
df_produto

,category,segment,product,productid,iscompetehide,manufacturerid
0,Urban,Convenience,Maximus UC-01,536,N,7
1,Urban,Convenience,Maximus UC-02,537,N,7
2,Urban,Convenience,Maximus UC-03,538,N,7
3,Urban,Convenience,Maximus UC-04,539,N,7
4,Urban,Convenience,Maximus UC-05,540,N,7
...,...,...,...,...,...,...
2407,Mix,Productivity,Quibus MP-28,1260,N,12
2408,Mix,Productivity,Quibus MP-29,1261,N,12
2409,Mix,Productivity,Quibus MP-30,1262,N,12
2410,Mix,Productivity,Quibus MP-31,1263,N,12
2411,Mix,Productivity,Quibus MP-32,1264,N,12

In [8]:
df_vendas = pd.read_csv('vendas.csv',',')
df_vendas

         productid                    date    zip  units      revenue
0               88  15/02/2000 12:00:00 AM  95605     92  $926,780.40
1             2263  12/11/2008 12:00:00 AM  33178     44  $177,380.28
2             2262  12/11/2008 12:00:00 AM  33178     44  $177,380.28
3              764  27/07/2004 12:00:00 AM  27522     40  $146,134.80
4              763  27/07/2004 12:00:00 AM  27522     40  $146,134.80
...            ...                     ...    ...    ...          ...
1260747       2213  10/02/2006 12:00:00 AM  15135      1    $1,070.37
1260748       2213  03/06/2004 12:00:00 AM  80120      1    $1,070.37
1260749       2213  27/11/2003 12:00:00 AM  30028      1    $1,070.37
1260750       2213  30/09/2006 12:00:00 AM  65279      1    $1,070.37
1260751       2213  22/06/2005 12:00:00 AM  25526      1    $1,070.37

[1260752 rows x 5 columns]

In [9]:

df2 =df_produto[df_produto["manufacturerid"] == 7]
df2

,category,segment,product,productid,iscompetehide,manufacturerid
0,Urban,Convenience,Maximus UC-01,536,N,7
1,Urban,Convenience,Maximus UC-02,537,N,7
2,Urban,Convenience,Maximus UC-03,538,N,7
3,Urban,Convenience,Maximus UC-04,539,N,7
4,Urban,Convenience,Maximus UC-05,540,N,7
...,...,...,...,...,...,...
1152,Urban,Regular,Maximus UR-01,512,N,7
1451,Rural,Select,Maximus RS-01,394,N,7
1452,Rural,Select,Maximus RS-02,395,N,7
1994,Rural,Productivity,Maximus RP-01,392,N,7
1995,Rural,Productivity,Maximus RP-02,393,N,7

In [10]:
lista = df_produto["productid"]

In [11]:
x = df_vendas["zip"][df_vendas["productid"].isin(lista)]

In [14]:
x.nunique()

32595

In [25]:
df3 = df_geo[df_geo["zip"].isin(x)]

In [26]:
df3

         zip              city state region      district
0      15201    Pittsburgh, PA    PA   East  District #13
1      15202    Pittsburgh, PA    PA   East  District #13
2      15203    Pittsburgh, PA    PA   East  District #13
3      15204    Pittsburgh, PA    PA   East  District #13
4      15205    Pittsburgh, PA    PA   East  District #13
...      ...               ...   ...    ...           ...
39942  59932        Somers, MT    MT   West  District #33
39944  59934         Trego, MT    MT   West  District #33
39945  59935          Troy, MT    MT   West  District #33
39946  59936  West Glacier, MT    MT   West  District #33
39947  59937     Whitefish, MT    MT   West  District #33

[32595 rows x 5 columns]

In [50]:
d = df_geo[df_geo["state"] == "PA"]

In [51]:
d["city"].nunique()

1800

In [1]:
#cria uma classe para facilitar a manipulação do banco de dados no python
class MyServer:
    def __init__(self,banco=''):
        self.banco = banco

    #Cria uma conexão com o banco de dados
    def __conectDB(self,banco):
        #con = psycopg2.connect(host='amarelo.cp6xfa6zogly.us-east-2.rds.amazonaws.com', database=banco, user='postgres', password='postgres')
        con = psycopg2.connect(host='localhost', database=banco, user='postgres', password='postgres')
        return con
    #Cria um Database no banco
    def create_db(self,banco):
        sql = "CREATE DATABASE  {};".format(banco)
        con = self.__conectDB(self.banco)
        con.set_isolation_level(ISOLATION_LEVEL_AUTOCOMMIT);
        cur = con.cursor()
        try:
            cur.execute(sql)
            self.banco = banco
            print('Processo Executado com sucesso')
        except Exception as erro:
            print(erro)
        finally:
            con.commit()
            cur.close()
            con.close()

    #Executa uma quary no banco   
    def run_query(self,sql):
        con = self.__conectDB(self.banco)
        con.set_isolation_level(ISOLATION_LEVEL_AUTOCOMMIT);
        cur = con.cursor()
        try:
            cur.execute(sql)
            print('Processo Executado com sucesso')
        except Exception as erro:
            print(erro)
        finally:
            con.commit()
            cur.close()
            con.close()
    #retorna um recordset de um select no banco     
    def selectSQL(self,sql):
        con = self.__conectDB(self.banco)
        cur = con.cursor()
        try:
            cur.execute(sql)
            recortset = cur.fetchall()
            return recortset
        except Exception as erro:
            print(erro)

        finally:
            con.commit()
            cur.close()
            con.close()

In [4]:
aws_postgres = MyServer() #instaciando o objeto do tipo MyServer
aws_postgres.create_db('dbpy')

Processo Executado com sucesso

In [5]:
#Definições da tabela
sql = 'CREATE TABLE fabricante ( manufacturerid  serial, manufacturer  varchar(10),  CONSTRAINT fabricante_Pkey PRIMARY KEY (manufacturerid));'
#Criação da tabela no banco
aws_postgres.run_query(sql)

Processo Executado com sucesso

In [13]:
# eliminando a coluna de indice
df_fabricante = df_fabricante.drop(columns='Unnamed: 0').sort_values(by='manufacturerid', \
                                                                     ascending=True).reset_index(drop=True)
df_fabricante

    manufacturerid manufacturer
0                1        Abbas
1                2       Aliqui
2                3        Barba
3                4       Currus
4                5         Fama
5                6          Leo
6                7    VanArsdel
7                8       Natura
8                9        Palma
9               10        Pirum
10              11        Pomum
11              12       Quibus
12              13       Salvus
13              14     Victoria

In [14]:
#exportação do banco em pandas para o banco de dados
tabela = 'fabricante'
col = {"manufacturerid": types.String(), "manufacturer": types.String() }
engine = create_engine('postgresql://postgres:postgres@localhost:5432/dbpy')
#engine = create_engine('postgresql://postgres:postgres@amarelo.cp6xfa6zogly.us-east-2.rds.amazonaws.com:5432/dbpy')
df_fabricante.to_sql(name=tabela,con=engine,index=False,dtype=col,if_exists='append')

In [15]:
df_geo = pd.read_csv('geo.csv',',')
df_geo['city'], df_geo['state'] = zip(*df_geo['city'].str.split(','))
df_geo['state'] = df_geo['state'].astype('str')
df_geo['state'] = df_geo['state'].str.strip()
#Definições da tabela
sql = 'CREATE TABLE geo ( id  serial, zip  varchar(5) UNIQUE, city  varchar(50), state  varchar(2), '\
'region  varchar(10), district  varchar(12),  CONSTRAINT geo_Pkey PRIMARY KEY (id));'
#Criação da tabela no banco
aws_postgres.run_query(sql)

Processo Executado com sucesso

In [16]:
#exportação do banco em pandas para o banco de dados
tabela = 'geo'
col = { 'zip' :types.String(), 'city' : types.String(),'state' :types.String(), \
                     'region': types.String() , 'district': types.String()}
df_geo.to_sql(name=tabela,con=engine,index=False,dtype=col,if_exists='append',method='multi')

In [17]:
df_produto = pd.read_csv('produto.csv',',')
df_produto

,category,segment,product,productid,iscompetehide,manufacturerid
0,Urban,Convenience,Maximus UC-01,536,N,7
1,Urban,Convenience,Maximus UC-02,537,N,7
2,Urban,Convenience,Maximus UC-03,538,N,7
3,Urban,Convenience,Maximus UC-04,539,N,7
4,Urban,Convenience,Maximus UC-05,540,N,7
...,...,...,...,...,...,...
2407,Mix,Productivity,Quibus MP-28,1260,N,12
2408,Mix,Productivity,Quibus MP-29,1261,N,12
2409,Mix,Productivity,Quibus MP-30,1262,N,12
2410,Mix,Productivity,Quibus MP-31,1263,N,12
2411,Mix,Productivity,Quibus MP-32,1264,N,12

In [18]:
sql = 'CREATE TABLE produto ( id  SERIAL, category  VARCHAR(5),' \
       'segment  VARCHAR(20), product  VARCHAR(20), productid  BIGINT UNIQUE, iscompetehide  CHAR(1), '\
        'manufacturerid  BIGINT REFERENCES fabricante (manufacturerid), '\
        'CONSTRAINT produtos_Pkey PRIMARY KEY (id));'

In [19]:
aws_postgres.run_query(sql)

Processo Executado com sucesso

In [20]:
#exportação do banco em pandas para o banco de dados
col = { 'category' :types.String(), 'segment' : types.String(),'product' :types.String(), \
                     'productid': types.Integer , 'iscompetehide': types.String(), 'manufacturerid': types.String()}
tabela = 'produto'
df_produto.to_sql(name=tabela,con=engine,index=False,dtype=col,if_exists='append',method='multi')

In [21]:
df_vendas = pd.read_csv('vendas.csv',',')
df_vendas['date'] = pd.to_datetime(df_vendas['date'].str.slice(0,10,1),format = '%d/%m/%Y')
df_vendas['revenue'] = df_vendas['revenue'].str.replace('$','')
df_vendas['revenue'] = df_vendas['revenue'].str.replace(',','')
df_vendas['revenue'] = df_vendas['revenue'].astype('float')
sql = 'CREATE TABLE vendas ( id  SERIAL, productid  BIGINT REFERENCES produto (productid),' \
       'date  DATE, zip  VARCHAR(5) REFERENCES geo (zip), units  BIGINT, revenue  DECIMAL, '\
        'CONSTRAINT vendas_Pkey PRIMARY KEY (id));'
aws_postgres.run_query(sql)

Processo Executado com sucesso

In [22]:
#exportação do banco em pandas para o banco de dados
col = { 'productid' :types.Integer(), 'date' : types.Date(),'zip' :types.String(), \
                     'units': types.Integer , 'revenue': types.DECIMAL()}
tabela = 'vendas'
df_vendas.to_sql(name=tabela,con=engine,index=False,dtype=col,if_exists='append')